tutorials/simpleFoam/pitzDaily3Blocks/constant/polyMesh/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices        
(
    (-20.6 0 -0.5)
    (-20.6 25.4 -0.5)
    (0 -25.4 -0.5)
    (0 0 -0.5)
    (0 25.4 -0.5)
    (206 -25.4 -0.5)
    (206 25.4 -0.5)
    (290 -16.6 -0.5)
    (290 16.6 -0.5)
    (-20.6 0 0.5)
    (-20.6 25.4 0.5)
    (0 -25.4 0.5)
    (0 0 0.5)
    (0 25.4 0.5)
    (206 -25.4 0.5)
    (206 25.4 0.5)
    (290 -16.6 0.5)
    (290 16.6 0.5)
);

blocks          
(
    hex (0 3 4 1 9 12 13 10) (18 30 1) simpleGrading (1 2 1)
    hex (2 5 6 4 11 14 15 13) (180 60 1) simpleGrading (1 2 1)
    hex (5 7 8 6 14 16 17 15) (30 60 1) simpleGrading (1 2 1)
);

edges           
(
);

patches         
(
    patch inlet 
    (
        (0 9 10 1)
    )
    patch outlet 
    (
        (8 17 16 7)
    )
    wall upperWall 
    (
        (1 10 13 4)
        (4 13 15 6)
        (6 15 17 8)
    )
    wall lowerWall 
    (
        (7 16 14 5)
        (5 14 11 2)
        (2 11 13 4)
    )
    wall lowerWallInlet
    (
        (3 12 9 0)
    )
    patch interface 
    (
        (4 13 12 3)
    )
);

mergePatchPairs
(
    ( lowerWall interface )	
);

// ************************************************************************* //
