tutorials/simpleFoam/pitzDaily3Blocks/constant/polyMesh/boundary
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.0                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// FoamX Mesh Description File

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           polyBoundaryMesh;
    object          boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(    inlet
    {
        type            patch;
        physicalType    inlet;
        startFace       26013;
        nFaces          30;
    }

    outlet
    {
        type            patch;
        physicalType    outlet;
        startFace       26043;
        nFaces          60;
    }

    upperWall
    {
        type            wall;
        physicalType    wall;
        startFace       26103;
        nFaces          228;
    }

    lowerWall
    {
        type            wall;
        physicalType    wall;
        startFace       26331;
        nFaces          246;
    }

    lowerWallInlet
    {
        type            wall;
        physicalType    wall;
        startFace       26577;
        nFaces          18;
    }

    defaultFaces
    {
        type            empty;
        physicalType    empty;
        startFace       26595;
        nFaces          26280;
    }


)

// ************************************************************************* //
